[
    {
        "input": "I can't believe they did that to me!",
        "emotion": "anger",
        "output": "I hear how upset you are. It's completely valid to feel angry when you've been wronged. Would you like to talk more about what happened?"
    },
    {
        "input": "Ugh, this is so disgusting",
        "emotion": "disgust",
        "output": "I sense this situation is really bothering you. Can you tell me more about what's causing this feeling of disgust?"
    },
    {
        "input": "I'm so scared about what might happen tomorrow",
        "emotion": "fear",
        "output": "Fear about the unknown is completely natural. Let's break down what's worrying you into smaller, more manageable pieces."
    },
    {
        "input": "I got the promotion! I'm so excited!",
        "emotion": "happiness",
        "output": "Congratulations! This is wonderful news! Your hard work has paid off. Would you like to share what you're most looking forward to?"
    },
    {
        "input": "I just feel so empty inside lately",
        "emotion": "sadness",
        "output": "I'm sorry you're feeling this way. Sadness can feel overwhelming, but you're not alone. What's been on your mind recently?"
    },
    {
        "input": "Wait... what? That can't be right!",
        "emotion": "surprise",
        "output": "I can tell this news has caught you off guard. Would it help to take a moment to process this information together?"
    },
    {
        "input": "The meeting is scheduled for 3pm tomorrow",
        "emotion": "neutral",
        "output": "Thank you for sharing this information. Is there anything about the meeting that you'd like to discuss or prepare for?"
    },
    {
        "input": "They always look down on me like I'm nothing",
        "emotion": "contempt",
        "output": "Feeling dismissed by others is incredibly painful. You deserve to be treated with respect. Would you like to explore ways to address this situation?"
    },
    {
        "input": "This traffic is making me furious!",
        "emotion": "anger",
        "output": "Frustration in situations beyond our control is completely understandable. Maybe we can use this time to practice some deep breathing exercises?"
    },
    {
        "input": "The way they eat is just revolting",
        "emotion": "disgust",
        "output": "Strong reactions like this often come from deeper sensitivities. Would exploring why this bothers you so much be helpful?"
    },
    {
        "input": "I keep imagining the worst possible outcome",
        "emotion": "fear",
        "output": "Our minds often jump to worst-case scenarios when we're anxious. Let's examine how likely these outcomes really are."
    },
    {
        "input": "My baby took her first steps today!",
        "emotion": "happiness",
        "output": "What a beautiful milestone! These moments of joy are so precious. Would you like to share more about this special experience?"
    },
    {
        "input": "Nothing seems to bring me joy anymore",
        "emotion": "sadness",
        "output": "When the things we usually enjoy stop bringing happiness, it can feel especially lonely. Have you noticed any particular changes recently?"
    },
    {
        "input": "You're kidding me! I won the contest?",
        "emotion": "surprise",
        "output": "What wonderful news! You must be thrilled. How about we take a moment to celebrate this achievement?"
    },
    {
        "input": "The document has been submitted as requested",
        "emotion": "neutral",
        "output": "Thank you for the update. Is there anything else you'd like to accomplish today?"
    },
    {
        "input": "Their so-called 'help' was completely useless",
        "emotion": "contempt",
        "output": "It sounds like you felt let down by their assistance. What kind of support would have been more helpful for you?"
    },
    {
        "input": "How dare they speak to me that way!",
        "emotion": "anger",
        "output": "Being treated disrespectfully can be incredibly hurtful. Would you like to talk about what happened and how you might respond?"
    },
    {
        "input": "The smell in here is making me nauseous",
        "emotion": "disgust",
        "output": "Physical discomfort can really affect our mood. Is there a way you can remove yourself from this environment for a while?"
    },
    {
        "input": "I'm terrified of what the test results will show",
        "emotion": "fear",
        "output": "Waiting for medical results can be incredibly stressful. Would practicing some mindfulness techniques help while you wait?"
    },
    {
        "input": "We're going on our dream vacation next week!",
        "emotion": "happiness",
        "output": "How exciting! Anticipation is such a joyful part of travel. What are you most looking forward to about this trip?"
    },
    {
        "input": "I just want to curl up and cry all day",
        "emotion": "sadness",
        "output": "Some days feel heavier than others, and that's okay. Would you like to talk about what's weighing on you?"
    },
    {
        "input": "What? They're giving me a bonus?",
        "emotion": "surprise",
        "output": "What wonderful recognition of your hard work! How does it feel to receive this unexpected appreciation?"
    },
    {
        "input": "The printer is out of paper",
        "emotion": "neutral",
        "output": "Thank you for letting me know. Would you like me to help troubleshoot this issue?"
    },
    {
        "input": "Their opinion is completely worthless",
        "emotion": "contempt",
        "output": "It sounds like you have strong feelings about their perspective. What makes their opinion so unimportant to you?"
    },
    {
        "input": "I'm boiling mad right now!",
        "emotion": "anger",
        "output": "Anger can feel overwhelming when it's at its peak. Maybe we could try counting to ten together before responding?"
    },
    {
        "input": "That habit of theirs is so gross",
        "emotion": "disgust",
        "output": "Certain behaviors can trigger strong reactions in us. Is this something you've noticed bothering you frequently?"
    },
    {
        "input": "I'm afraid I'll never get better",
        "emotion": "fear",
        "output": "When we're in pain, it can feel like it will last forever. Remember that healing often isn't linear. What small improvement could we focus on today?"
    },
    {
        "input": "My garden is blooming beautifully this year!",
        "emotion": "happiness",
        "output": "Nature's beauty can be so uplifting! What's your favorite part of your garden right now?"
    },
    {
        "input": "I miss them so much it hurts",
        "emotion": "sadness",
        "output": "Grief and longing can feel physically painful at times. Would sharing a favorite memory of them bring you comfort?"
    },
    {
        "input": "Wait, you're telling me I was right all along?",
        "emotion": "surprise",
        "output": "Validation after doubt can be such a powerful moment. How does it feel to have your perspective confirmed?"
    },
    {
        "input": "The meeting has been rescheduled to Friday",
        "emotion": "neutral",
        "output": "Noted. Does this change affect any of your other plans that we should adjust?"
    },
    {
        "input": "Their pathetic attempt was laughable",
        "emotion": "contempt",
        "output": "It sounds like their effort fell far short of your expectations. What would have made their attempt more respectable to you?"
    },
    {
        "input": "I'm seeing red right now!",
        "emotion": "anger",
        "output": "When anger feels this intense, it's important to pause before acting. Would stepping away for a few minutes help you regain perspective?"
    },
    {
        "input": "The way they chew with their mouth open is vile",
        "emotion": "disgust",
        "output": "Certain behaviors can trigger surprisingly strong reactions. Is this something you're often exposed to?"
    },
    {
        "input": "What if I fail and everyone finds out?",
        "emotion": "fear",
        "output": "Fear of failure is so common, yet so personal. What would actually happen if things didn't go perfectly?"
    },
    {
        "input": "My team won the championship!",
        "emotion": "happiness",
        "output": "What an achievement! The energy of victory must be incredible. What was the most exciting moment for you?"
    },
    {
        "input": "Why does everything feel so meaningless?",
        "emotion": "sadness",
        "output": "When life feels empty, it can be hard to see a way forward. Have there been times recently when things felt more meaningful?"
    },
    {
        "input": "You're telling me I've been doing it wrong this whole time?",
        "emotion": "surprise",
        "output": "Discovering we've had a misunderstanding can be startling. How would you like to proceed now with this new information?"
    },
    {
        "input": "The report will be ready by end of day",
        "emotion": "neutral",
        "output": "Understood. Please let me know if you encounter any obstacles completing it."
    },
    {
        "input": "Their so-called expertise is a joke",
        "emotion": "contempt",
        "output": "It sounds like you have serious doubts about their qualifications. What specifically makes you question their expertise?"
    },
    {
        "input": "I could just scream right now!",
        "emotion": "anger",
        "output": "That intense need to release frustration is completely understandable. Sometimes a good scream into a pillow can actually help release that energy safely."
    },
    {
        "input": "The state of the bathroom is appalling",
        "emotion": "disgust",
        "output": "Unclean environments can really affect our comfort. Is this something you can report or avoid in the future?"
    },
    {
        "input": "I'm scared I'll never find someone who understands me",
        "emotion": "fear",
        "output": "The fear of being alone or misunderstood is deeply human. What qualities would someone need to truly understand you?"
    },
    {
        "input": "The baby finally slept through the night!",
        "emotion": "happiness",
        "output": "What a wonderful milestone for your family! That first full night's rest must feel amazing. How are you celebrating?"
    },
    {
        "input": "I don't have the energy for anything anymore",
        "emotion": "sadness",
        "output": "When even small tasks feel overwhelming, it's a sign to be extra gentle with yourself. What's one tiny thing that might feel manageable right now?"
    },
    {
        "input": "What do you mean I've been selected?",
        "emotion": "surprise",
        "output": "Positive surprises can be so delightful! Take a moment to let this good news sink in. How would you like to celebrate this recognition?"
    },
    {
        "input": "The files have been uploaded to the server",
        "emotion": "neutral",
        "output": "Thank you for completing that task. Is there anything else in your workflow that needs attention?"
    },
    {
        "input": "Their apology was completely insincere",
        "emotion": "contempt",
        "output": "When apologies feel hollow, it can compound the hurt. What would a meaningful apology look like to you in this situation?"
    },
    {
        "input": "I'm so mad I could punch something!",
        "emotion": "anger",
        "output": "That urge to physically release anger is understandable, but let's find a safer outlet. How about we try some vigorous exercise or a stress ball instead?"
    },
    {
        "input": "The thought of eating that makes me sick",
        "emotion": "disgust",
        "output": "Food aversions can be surprisingly powerful. Is this a new reaction or something you've experienced before?"
    },
    {
        "input": "I'm afraid to trust anyone ever again",
        "emotion": "fear",
        "output": "After being hurt, it's natural to build walls. What small step toward trust might feel safe to try when you're ready?"
    },
    {
        "input": "We're adopting a puppy next week!",
        "emotion": "happiness",
        "output": "How exciting! A new furry family member brings so much joy. What are you most looking forward to about pet ownership?"
    },
    {
        "input": "The world just feels so dark right now",
        "emotion": "sadness",
        "output": "When everything seems bleak, even small lights can be hard to see. Can you recall one tiny good thing from today, no matter how small?"
    },
    {
        "input": "Wait, that was the right answer all along?",
        "emotion": "surprise",
        "output": "Sometimes we doubt ourselves more than we should. How does it feel to have your initial instinct validated?"
    },
    {
        "input": "The system update will occur at midnight",
        "emotion": "neutral",
        "output": "Thank you for the information. Would you like me to remind you before it happens?"
    },
    {
        "input": "Their work is embarrassingly bad",
        "emotion": "contempt",
        "output": "Strong criticism often comes from high standards. What specifically about their work falls short of your expectations?"
    },
    {
        "input": "I'm furious at how unfair this is!",
        "emotion": "anger",
        "output": "Injustice can ignite powerful anger. Would brainstorming ways to address this unfairness help you feel more empowered?"
    },
    {
        "input": "The way they lick their fingers is revolting",
        "emotion": "disgust",
        "output": "Certain mannerisms can trigger surprisingly strong reactions. Is this something you can politely address or need to tolerate?"
    },
    {
        "input": "I'm terrified of being alone forever",
        "emotion": "fear",
        "output": "The fear of permanent loneliness is deeply painful. What small social connection might feel possible to cultivate right now?"
    },
    {
        "input": "My artwork got selected for the gallery show!",
        "emotion": "happiness",
        "output": "What an incredible honor for your creativity! Which piece was selected and what does it mean to you?"
    },
    {
        "input": "Nothing matters anymore",
        "emotion": "sadness",
        "output": "When everything feels meaningless, it's important to remember this is the depression talking, not reality. Can we identify one small thing that still matters to you?"
    },
    {
        "input": "You mean I've been eligible this whole time?",
        "emotion": "surprise",
        "output": "Discovering missed opportunities can be shocking. How would you like to proceed now that you have this information?"
    },
    {
        "input": "The package is scheduled for delivery tomorrow",
        "emotion": "neutral",
        "output": "Thank you for the update. Would you like me to track it for you?"
    },
    {
        "input": "Their attempt at humor was pathetic",
        "emotion": "contempt",
        "output": "Humor is so subjective, and when it misses the mark it can fall flat. What kind of humor do you typically enjoy instead?"
    },
    {
        "input": "I'm so angry I can't even think straight!",
        "emotion": "anger",
        "output": "When anger clouds our thinking, sometimes the best first step is simply to pause and breathe. Would you like to try a grounding exercise together?"
    },
    {
        "input": "The smell of that perfume is nauseating",
        "emotion": "disgust",
        "output": "Strong scents can be overwhelming. Is this something you can avoid or need help addressing with the person wearing it?"
    },
    {
        "input": "I'm scared I'll never achieve my dreams",
        "emotion": "fear",
        "output": "The gap between where we are and where we want to be can feel terrifying. What's one small step you could take today toward your goals?"
    },
    {
        "input": "We're celebrating our 20th anniversary today!",
        "emotion": "happiness",
        "output": "What a beautiful milestone in your relationship! What's your favorite memory from these twenty years together?"
    },
    {
        "input": "I don't see the point in trying anymore",
        "emotion": "sadness",
        "output": "When motivation disappears, it's a sign you've been carrying heavy burdens. What's one tiny thing that might feel worth doing today?"
    },
    {
        "input": "What? I won the scholarship?",
        "emotion": "surprise",
        "output": "This is fantastic news! Your hard work has been recognized. How will you celebrate this achievement?"
    },
    {
        "input": "The documents have been signed and notarized",
        "emotion": "neutral",
        "output": "That's an important step completed. Would you like me to help organize the next steps in this process?"
    },
    {
        "input": "Their so-called 'help' just made everything worse",
        "emotion": "contempt",
        "output": "When assistance backfires, it can feel especially frustrating. What kind of support would actually be helpful to you right now?"
    },
    {
        "input": "I'm boiling with rage right now!",
        "emotion": "anger",
        "output": "That intense heat of anger needs safe release. How about we channel that energy into something productive, like a brisk walk or journaling?"
    },
    {
        "input": "The way they handle food is unsanitary",
        "emotion": "disgust",
        "output": "Food safety is important, and breaches can be upsetting. Is this something you can address directly or report appropriately?"
    },
    {
        "input": "I'm afraid I'll never get over this",
        "emotion": "fear",
        "output": "The fear that pain will last forever is common when we're in its grip. Healing often comes in waves - what small relief have you noticed?"
    },
    {
        "input": "My novel is getting published!",
        "emotion": "happiness",
        "output": "What an incredible accomplishment! Seeing your creative work reach readers must be thrilling. What's the central message of your story?"
    },
    {
        "input": "I just feel so hopeless about everything",
        "emotion": "sadness",
        "output": "Hopelessness makes the future seem dark, but feelings aren't facts. Can we look for one small glimmer of possibility together?"
    },
    {
        "input": "Wait, that was the correct procedure all along?",
        "emotion": "surprise",
        "output": "How validating to have your approach confirmed! Does this change how you'll proceed with similar tasks in the future?"
    },
    {
        "input": "The software update is complete",
        "emotion": "neutral",
        "output": "Thank you for the update. Have you noticed any improvements or issues with the new version?"
    },
    {
        "input": "Their performance was amateurish at best",
        "emotion": "contempt",
        "output": "When we expect professionalism and see less, it's disappointing. What specifically fell short of your standards?"
    },
    {
        "input": "I'm seeing red! How could they do this?",
        "emotion": "anger",
        "output": "That sense of betrayal cuts deep. Would talking through what happened help you process these intense feelings?"
    },
    {
        "input": "The state of the kitchen is absolutely vile",
        "emotion": "disgust",
        "output": "Unclean living spaces can really affect our mental wellbeing. Would creating a cleaning plan help regain your comfort?"
    },
    {
        "input": "I'm scared I'll never feel normal again",
        "emotion": "fear",
        "output": "When we're in pain or crisis, imagining future wellness can feel impossible. What does 'normal' look like to you in small steps?"
    },
    {
        "input": "We're expecting a baby!",
        "emotion": "happiness",
        "output": "What incredible news! A new life is such a beautiful journey. How are you preparing for this wonderful change?"
    },
    {
        "input": "I can't stop crying and I don't know why",
        "emotion": "sadness",
        "output": "Sometimes tears come without clear reasons, and that's okay. They're often releasing what words can't express. Can you be gentle with yourself in this moment?"
    },
    {
        "input": "You mean I've been approved for the loan?",
        "emotion": "surprise",
        "output": "Financial relief can be such a weight off your shoulders! How will this positive development change your plans?"
    },
    {
        "input": "The meeting minutes have been distributed",
        "emotion": "neutral",
        "output": "Thank you for handling that. Are there any action items from the meeting we should prioritize?"
    },
    {
        "input": "Their ignorance is astounding",
        "emotion": "contempt",
        "output": "When others lack knowledge we expect them to have, it can be frustrating. Is this something worth educating them about?"
    },
    {
        "input": "I'm so mad I'm shaking!",
        "emotion": "anger",
        "output": "That physical reaction shows how strongly you're feeling this. Let's focus on calming your nervous system first with some deep breaths."
    },
    {
        "input": "The thought of touching that is repulsive",
        "emotion": "disgust",
        "output": "Strong physical aversions are powerful signals. Is this something you can avoid or need to find a way to manage?"
    },
    {
        "input": "I'm afraid I'll always feel this broken",
        "emotion": "fear",
        "output": "The fear that pain will never end is one of its most powerful tricks. Healing often happens in ways we can't predict. What small sign of resilience might you be overlooking?"
    },
    {
        "input": "We're buying our first home!",
        "emotion": "happiness",
        "output": "What an exciting milestone! A home holds so many future memories. What are you most looking forward to about this new space?"
    },
    {
        "input": "I just don't care about anything anymore",
        "emotion": "sadness",
        "output": "When apathy sets in, it's often our mind's way of protecting us from overwhelm. What's one tiny thing that used to bring you comfort?"
    },
    {
        "input": "What? They're giving me another chance?",
        "emotion": "surprise",
        "output": "Second chances can be powerful opportunities. How do you feel about this unexpected turn of events?"
    },
    {
        "input": "The files have been backed up as requested",
        "emotion": "neutral",
        "output": "Good to know your data is secure. Would you like to set up automatic backups for future peace of mind?"
    },
    {
        "input": "Their lack of preparation is laughable",
        "emotion": "contempt",
        "output": "When others don't meet basic expectations, it can be baffling. Is their preparation something you can influence or need to accept?"
    },
    {
        "input": "I want to throw something against the wall!",
        "emotion": "anger",
        "output": "That urge to physically express anger is understandable. How about we channel that energy into something less destructive, like tearing up paper or punching a pillow?"
    },
    {
        "input": "The bathroom conditions are absolutely foul",
        "emotion": "disgust",
        "output": "Unsanitary conditions can really affect our wellbeing. Is this something you can report or avoid in the future?"
    },
    {
        "input": "I'm terrified of making the wrong decision",
        "emotion": "fear",
        "output": "Decision paralysis is so common when the stakes feel high. What would a 'good enough' choice look like here?"
    },
    {
        "input": "My daughter just graduated with honors!",
        "emotion": "happiness",
        "output": "What an amazing achievement for your family! You must be so proud of her hard work. How are you celebrating this milestone?"
    },
    {
        "input": "I feel like I'm drowning in sadness",
        "emotion": "sadness",
        "output": "That overwhelming feeling can make it hard to breathe. Let's focus on just getting through this moment together. You're not alone."
    },
    {
        "input": "Wait, that was the solution all along?",
        "emotion": "surprise",
        "output": "Sometimes answers are simpler than we imagine! How does it feel to have this resolution after your struggle?"
    },
    {
        "input": "The system reboot is complete",
        "emotion": "neutral",
        "output": "Thank you for the update. Have all functions returned to normal operation?"
    },
    {
        "input": "Their incompetence is staggering",
        "emotion": "contempt",
        "output": "When others fail at basic tasks, it can shake our confidence in systems. Is this something you need to address or work around?"
    },
    {
        "input": "I'm so angry I can't even speak!",
        "emotion": "anger",
        "output": "When words fail us in anger, sometimes silence is the wisest response. Would you like to try some silent counting together to regain composure?"
    },
    {
        "input": "The way they handle food makes my skin crawl",
        "emotion": "disgust",
        "output": "Certain behaviors can trigger visceral reactions. Is this something you can politely address or need to distance yourself from?"
    },
    {
        "input": "I'm afraid I'll never feel safe again",
        "emotion": "fear",
        "output": "After trauma, safety can feel like a distant memory. What's one small thing that might help you feel slightly more secure right now?"
    },
    {
        "input": "We're celebrating 50 years of marriage today!",
        "emotion": "happiness",
        "output": "What an incredible love story! Fifty years of partnership is truly inspiring. What's your secret to lasting love?"
    },
    {
        "input": "The pain just won't go away",
        "emotion": "sadness",
        "output": "Enduring emotional pain requires such strength, even when no one sees it. Would sharing some of this burden help lighten it?"
    },
    {
        "input": "You're telling me I qualified all along?",
        "emotion": "surprise",
        "output": "What a relief to discover you had this opportunity available! How does this change your current situation?"
    },
    {
        "input": "The report has been submitted to the committee",
        "emotion": "neutral",
        "output": "Thank you for completing that important task. Would you like me to help prepare for any follow-up questions?"
    },
    {
        "input": "Their laziness is unbelievable",
        "emotion": "contempt",
        "output": "When others don't meet basic effort expectations, it can be frustrating. Is this something affecting your work directly?"
    },
    {
        "input": "I'm furious beyond words!",
        "emotion": "anger",
        "output": "That level of anger needs careful handling. Let's focus on getting you to a calmer place before addressing what triggered this."
    },
    {
        "input": "The smell in here is making me gag",
        "emotion": "disgust",
        "output": "Strong physical reactions like this are important signals. Can you remove yourself from this environment for some fresh air?"
    },
    {
        "input": "I'm scared I'll never be happy again",
        "emotion": "fear",
        "output": "When we're in pain, imagining future happiness can feel impossible. What tiny thing has brought you even momentary relief recently?"
    },
    {
        "input": "My son just got accepted to his dream school!",
        "emotion": "happiness",
        "output": "What fantastic news! All his hard work has paid off. How is your family celebrating this achievement?"
    },
    {
        "input": "I don't have the strength to keep going",
        "emotion": "sadness",
        "output": "When you're running on empty, even standing still is an act of courage. Can we look for one tiny source of replenishment?"
    },
    {
        "input": "What? The test came back negative?",
        "emotion": "surprise",
        "output": "What a relief this must be after your worry! How are you processing this good news?"
    },
    {
        "input": "The task has been completed as instructed",
        "emotion": "neutral",
        "output": "Thank you for confirming. Is there another task you'd like to prioritize now?"
    },
    {
        "input": "Their lack of basic knowledge is appalling",
        "emotion": "contempt",
        "output": "When others lack knowledge we consider fundamental, it can be shocking. Is this something worth addressing with them?"
    },
    {
        "input": "I'm so angry I'm seeing stars!",
        "emotion": "anger",
        "output": "That intense physical reaction shows how deeply you're feeling this. Let's focus on your breathing first to help your body calm down."
    },
    {
        "input": "The texture of this food is revolting",
        "emotion": "disgust",
        "output": "Food aversions can be so specific and powerful. Is this something you can politely decline or need to find a way to manage?"
    },
    {
        "input": "I'm afraid I'll never recover from this",
        "emotion": "fear",
        "output": "When we're in the depths of pain or illness, recovery can feel impossible. Healing often happens in ways we can't predict. What's one small sign of progress you might be overlooking?"
    },
    {
        "input": "We're finally debt-free!",
        "emotion": "happiness",
        "output": "What an incredible financial milestone! The discipline this took is impressive. How will you celebrate this new chapter?"
    },
    {
        "input": "I just feel so empty inside",
        "emotion": "sadness",
        "output": "That hollow feeling can be so lonely. Sometimes naming it is the first step toward filling the space again. You're not alone in this."
    },
    {
        "input": "Wait, the solution was that simple?",
        "emotion": "surprise",
        "output": "Sometimes we overlook simple answers when we're deep in a problem. How does it feel to have this resolution after your struggle?"
    },
    {
        "input": "The backup is complete and verified",
        "emotion": "neutral",
        "output": "Good to know your data is secure. Would you like to schedule regular automated backups?"
    },
    {
        "input": "Their carelessness is beyond belief",
        "emotion": "contempt",
        "output": "When others don't take basic care, it can feel disrespectful. Is this something affecting you directly that needs addressing?"
    },
    {
        "input": "I'm so mad I could scream!",
        "emotion": "anger",
        "output": "That need for release is completely understandable. How about we find a healthy outlet for that energy, like vigorous exercise or journaling?"
    },
    {
        "input": "The state of their living space is horrifying",
        "emotion": "disgust",
        "output": "Unclean environments can trigger strong reactions. Is this something you need to address with them or distance yourself from?"
    },
    {
        "input": "I'm terrified of what comes next",
        "emotion": "fear",
        "output": "Facing the unknown can feel paralyzing. What's one small piece of information that might make the future feel slightly more manageable?"
    },
    {
        "input": "My artwork sold for more than I imagined!",
        "emotion": "happiness",
        "output": "What wonderful validation of your creative work! How does it feel to have others value your art so highly?"
    },
    {
        "input": "I don't know how to keep going",
        "emotion": "sadness",
        "output": "When continuing feels impossible, sometimes we just need to get through the next moment. Can we focus on that together right now?"
    },
    {
        "input": "You mean I've been worrying for nothing?",
        "emotion": "surprise",
        "output": "How relieving to discover your fears were unfounded! Take a moment to let that relief sink in. How does your body feel with this weight lifted?"
    },
    {
        "input": "The system diagnostics are complete",
        "emotion": "neutral",
        "output": "Thank you for running those. Were there any issues that need addressing?"
    },
    {
        "input": "Their lack of common sense is astounding",
        "emotion": "contempt",
        "output": "When others lack judgment we consider basic, it can be frustrating. Is this something you need to work around or can address?"
    },
    {
        "input": "I'm furious beyond measure!",
        "emotion": "anger",
        "output": "That depth of anger needs careful handling. Let's focus on getting you to a calmer place before addressing what triggered this."
    },
    {
        "input": "The way they eat is absolutely disgusting",
        "emotion": "disgust",
        "output": "Certain behaviors can trigger surprisingly strong reactions. Is this something you're frequently exposed to?"
    },
    {
        "input": "I'm afraid I'll never feel like myself again",
        "emotion": "fear",
        "output": "After difficult experiences, rediscovering ourselves takes time. What's one small thing that still feels authentically 'you'?"
    },
    {
        "input": "We're taking our dream vacation next month!",
        "emotion": "happiness",
        "output": "How exciting! Anticipating travel can be half the joy. What are you most looking forward to about this trip?"
    },
    {
        "input": "I just want the pain to stop",
        "emotion": "sadness",
        "output": "That simple, profound wish in hard times is so understandable. Would sharing some of this pain help lighten its weight?"
    },
    {
        "input": "What? The problem fixed itself?",
        "emotion": "surprise",
        "output": "How relieving when solutions emerge unexpectedly! Take a moment to appreciate this turn of events. How does your body feel with this worry resolved?"
    },
    {
        "input": "The documents have been processed",
        "emotion": "neutral",
        "output": "Thank you for the update. Is there anything else in this workflow that needs attention?"
    },
    {
        "input": "Their incompetence is breathtaking",
        "emotion": "contempt",
        "output": "When others fail at basic tasks, it can shake our confidence. Is this something affecting your work directly?"
    },
    {
        "input": "I'm so angry I can't see straight!",
        "emotion": "anger",
        "output": "When anger affects us physically, it's important to pause before acting. Would stepping away for a few minutes help you regain perspective?"
    },
    {
        "input": "The smell is making me physically ill",
        "emotion": "disgust",
        "output": "Strong physical reactions like this are important signals. Can you remove yourself from this environment immediately?"
    },
    {
        "input": "I'm scared I'll never achieve my goals",
        "emotion": "fear",
        "output": "The gap between where we are and where we want to be can feel overwhelming. What's one tiny step you could take today?"
    },
    {
        "input": "My research got published in a top journal!",
        "emotion": "happiness",
        "output": "What an incredible professional achievement! Your dedication has paid off. How will you celebrate this recognition?"
    },
    {
        "input": "I don't see any light at the end of the tunnel",
        "emotion": "sadness",
        "output": "When the future seems dark, it's hard to imagine light returning. Would you be willing to trust that I can see possibilities you can't right now?"
    },
    {
        "input": "Wait, the answer was right in front of me?",
        "emotion": "surprise",
        "output": "How funny when solutions are obvious in hindsight! Be gentle with yourself - we all overlook things when we're close to a problem."
    },
    {
        "input": "The update has been installed successfully",
        "emotion": "neutral",
        "output": "Good to know the process completed correctly. Have you noticed any improvements with the new version?"
    },
    {
        "input": "Their lack of preparation is unbelievable",
        "emotion": "contempt",
        "output": "When others don't meet basic expectations, it can be frustrating. Is this something you can address or need to accept?"
    },
    {
        "input": "I'm seeing red! This is unacceptable!",
        "emotion": "anger",
        "output": "That sense of injustice is fueling your anger. Would brainstorming ways to address this situation help you feel more empowered?"
    },
    {
        "input": "The texture makes me want to vomit",
        "emotion": "disgust",
        "output": "Such strong physical reactions are important signals. Is this something you can avoid or need to find a way to manage?"
    },
    {
        "input": "I'm afraid I'll never get past this",
        "emotion": "fear",
        "output": "When we're in pain, imagining future healing can feel impossible. What's one small sign that you're stronger than you think?"
    },
    {
        "input": "We're celebrating our 10th anniversary today!",
        "emotion": "happiness",
        "output": "What a beautiful milestone in your relationship! What's your favorite memory from this decade together?"
    },
    {
        "input": "I just can't stop crying",
        "emotion": "sadness",
        "output": "Sometimes tears need to flow without interruption. Can you be gentle with yourself as this emotion moves through you?"
    },
    {
        "input": "You're telling me it was here the whole time?",
        "emotion": "surprise",
        "output": "How funny when what we need was nearby all along! Be kind to yourself - this happens to everyone sometimes."
    },
    {
        "input": "The report has been finalized and sent",
        "emotion": "neutral",
        "output": "Thank you for completing that important task. Is there anything else needing your attention now?"
    },
    {
        "input": "Their ignorance is beyond comprehension",
        "emotion": "contempt",
        "output": "When others lack knowledge we consider basic, it can be shocking. Is this worth addressing or better to accept?"
    },
    {
        "input": "I'm so angry I could explode!",
        "emotion": "anger",
        "output": "That intense pressure needs safe release. How about we channel that energy into something physical but harmless, like vigorous exercise?"
    },
    {
        "input": "The way they handle food is stomach-turning",
        "emotion": "disgust",
        "output": "Certain behaviors can trigger surprisingly strong reactions. Is this something you can politely address or need to tolerate?"
    },
    {
        "input": "I'm scared I'll always feel this broken",
        "emotion": "fear",
        "output": "The fear that pain will never end is one of its most powerful illusions. Healing often happens in ways we can't predict. What small sign of resilience might you be overlooking?"
    },
    {
        "input": "My book is being published in five languages!",
        "emotion": "happiness",
        "output": "What an incredible achievement for your writing! Your words will reach so many readers. How does it feel to have this global recognition?"
    },
    {
        "input": "I don't have the energy to face another day",
        "emotion": "sadness",
        "output": "When even waking feels like too much, it's a sign to be extra gentle with yourself. What's one tiny thing that might feel manageable right now?"
    },
    {
        "input": "Wait, the problem wasn't what I thought?",
        "emotion": "surprise",
        "output": "How interesting when our assumptions prove wrong! This new understanding might lead to better solutions. How does this change your approach?"
    },
    {
        "input": "The files have been archived as requested",
        "emotion": "neutral",
        "output": "Thank you for completing that organizational task. Would you like me to help with any other records management?"
    },
    {
        "input": "Their laziness is beyond belief",
        "emotion": "contempt",
        "output": "When others don't meet basic effort expectations, it can be frustrating. Is this something affecting your work directly?"
    },
    {
        "input": "I'm furious beyond words!",
        "emotion": "anger",
        "output": "That level of anger needs careful handling. Let's focus on getting you to a calmer place before addressing what triggered this."
    },
    {
        "input": "The smell is making me physically sick",
        "emotion": "disgust",
        "output": "Strong physical reactions like this are important signals. Can you remove yourself from this environment immediately?"
    },
    {
        "input": "I'm afraid I'll never feel safe again",
        "emotion": "fear",
        "output": "After trauma, safety can feel like a distant memory. What's one small thing that might help you feel slightly more secure right now?"
    },
    {
        "input": "We're adopting twins!",
        "emotion": "happiness",
        "output": "What incredible news! Double the love coming into your family. How are you preparing for this wonderful adventure?"
    },
    {
        "input": "The pain just won't go away",
        "emotion": "sadness",
        "output": "Enduring emotional pain requires such strength, even when no one sees it. Would sharing some of this burden help lighten it?"
    },
    {
        "input": "You mean I've been worried for nothing?",
        "emotion": "surprise",
        "output": "How relieving to discover your fears were unfounded! Take a moment to appreciate this positive outcome. How does your body feel with this worry lifted?"
    },
    {
        "input": "The system maintenance is complete",
        "emotion": "neutral",
        "output": "Thank you for the update. Have all functions returned to normal operation?"
    },
    {
        "input": "Their incompetence is staggering",
        "emotion": "contempt",
        "output": "When others fail at basic tasks, it can shake our confidence in systems. Is this something you need to address or work around?"
    },
    {
        "input": "I'm so angry I could punch something!",
        "emotion": "anger",
        "output": "That urge to physically release anger is understandable, but let's find a safer outlet. How about we try some vigorous exercise or a stress ball instead?"
    },
    {
        "input": "The thought of eating that makes me sick",
        "emotion": "disgust",
        "output": "Food aversions can be surprisingly powerful. Is this a new reaction or something you've experienced before?"
    },
    {
        "input": "I'm scared I'll never get over this",
        "emotion": "fear",
        "output": "The fear that pain will last forever is common when we're in its grip. Healing often comes in waves - what small relief have you noticed?"
    },
    {
        "input": "My daughter just got engaged!",
        "emotion": "happiness",
        "output": "What wonderful news! This is such a special time for your family. How are you celebrating this happy occasion?"
    },
    {
        "input": "I don't see the point in anything anymore",
        "emotion": "sadness",
        "output": "When everything feels meaningless, it's important to remember this is the depression talking, not reality. Can we identify one small thing that still matters to you?"
    },
    {
        "input": "Wait, that was the right answer all along?",
        "emotion": "surprise",
        "output": "Sometimes we doubt ourselves more than we should. How does it feel to have your initial instinct validated?"
    },
    {
        "input": "The package has been delivered",
        "emotion": "neutral",
        "output": "Thank you for the update. Was everything in the shipment as expected?"
    },
    {
        "input": "Their lack of effort is pathetic",
        "emotion": "contempt",
        "output": "When others don't meet basic expectations, it can be frustrating. Is this something you can address or need to accept?"
    },
    {
        "input": "I'm boiling with rage right now!",
        "emotion": "anger",
        "output": "That intense heat of anger needs safe release. How about we channel that energy into something productive, like a brisk walk or journaling?"
    },
    {
        "input": "The way they lick their fingers is revolting",
        "emotion": "disgust",
        "output": "Certain mannerisms can trigger surprisingly strong reactions. Is this something you can politely address or need to tolerate?"
    },
    {
        "input": "I'm terrified of being alone forever",
        "emotion": "fear",
        "output": "The fear of permanent loneliness is deeply painful. What small social connection might feel possible to cultivate right now?"
    },
    {
        "input": "We're celebrating our 25th anniversary today!",
        "emotion": "happiness",
        "output": "What a beautiful milestone in your relationship! A quarter-century together is truly inspiring. What's your secret to lasting love?"
    },
    {
        "input": "I just feel so hopeless about everything",
        "emotion": "sadness",
        "output": "Hopelessness makes the future seem dark, but feelings aren't facts. Can we look for one small glimmer of possibility together?"
    },
    {
        "input": "What? They're giving me another chance?",
        "emotion": "surprise",
        "output": "Second chances can be powerful opportunities. How do you feel about this unexpected turn of events?"
    },
    {
        "input": "The documents have been signed and filed",
        "emotion": "neutral",
        "output": "Thank you for completing that important paperwork. Is there anything else in this process that needs attention?"
    },
    {
        "input": "Their carelessness is unbelievable",
        "emotion": "contempt",
        "output": "When others don't take basic care, it can feel disrespectful. Is this something affecting you directly that needs addressing?"
    },
    {
        "input": "I'm so angry I can't even think straight!",
        "emotion": "anger",
        "output": "When anger clouds our thinking, sometimes the best first step is simply to pause and breathe. Would you like to try a grounding exercise together?"
    },
    {
        "input": "The smell of that perfume is nauseating",
        "emotion": "disgust",
        "output": "Strong scents can be overwhelming. Is this something you can avoid or need help addressing with the person wearing it?"
    },
    {
        "input": "I'm scared I'll never achieve my dreams",
        "emotion": "fear",
        "output": "The gap between where we are and where we want to be can feel terrifying. What's one small step you could take today toward your goals?"
    },
    {
        "input": "My son just got his driver's license!",
        "emotion": "happiness",
        "output": "What an exciting milestone for your family! How are you feeling about this new chapter of independence?"
    },
    {
        "input": "I don't have the strength to keep going",
        "emotion": "sadness",
        "output": "When you're running on empty, even standing still is an act of courage. Can we look for one tiny source of replenishment?"
    },
    {
        "input": "Wait, that was the correct procedure all along?",
        "emotion": "surprise",
        "output": "How validating to have your approach confirmed! Does this change how you'll proceed with similar tasks in the future?"
    },
    {
        "input": "The software update is complete",
        "emotion": "neutral",
        "output": "Thank you for the update. Have you noticed any improvements or issues with the new version?"
    },
    {
        "input": "Their lack of common sense is astounding",
        "emotion": "contempt",
        "output": "When others lack judgment we consider basic, it can be frustrating. Is this something you need to work around or can address?"
    },
    {
        "input": "I'm furious at how unfair this is!",
        "emotion": "anger",
        "output": "Injustice can ignite powerful anger. Would brainstorming ways to address this unfairness help you feel more empowered?"
    },
    {
        "input": "The state of the kitchen is absolutely vile",
        "emotion": "disgust",
        "output": "Unclean living spaces can really affect our mental wellbeing. Would creating a cleaning plan help regain your comfort?"
    },
    {
        "input": "I'm afraid I'll never feel normal again",
        "emotion": "fear",
        "output": "When we're in pain or crisis, imagining future wellness can feel impossible. What does 'normal' look like to you in small steps?"
    },
    {
        "input": "We're expecting our first grandchild!",
        "emotion": "happiness",
        "output": "What incredible news! A new generation in your family is such a blessing. How are you preparing for this joyful role?"
    },
    {
        "input": "I can't stop crying and I don't know why",
        "emotion": "sadness",
        "output": "Sometimes tears come without clear reasons, and that's okay. They're often releasing what words can't express. Can you be gentle with yourself in this moment?"
    },
    {
        "input": "You mean I've been approved for the loan?",
        "emotion": "surprise",
        "output": "Financial relief can be such a weight off your shoulders! How will this positive development change your plans?"
    },
    {
        "input": "The meeting minutes have been distributed",
        "emotion": "neutral",
        "output": "Thank you for handling that. Are there any action items from the meeting we should prioritize?"
    }
]